app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT `uploads`.* FROM `uploads` ORDER BY `uploads`.`id` DESC LIMIT 1

  def show
    @upload = Upload.find_by_upload_file_size(params[:id])
---
SELECT `uploads`.* FROM `uploads` WHERE `uploads`.`upload_file_size` = 2624 LIMIT 1

  def create
    @upload = Upload.new(params[:upload])
    respond_to do |format|
      if @upload.save
---
INSERT INTO `uploads` (`created_at`, `updated_at`, `upload_content_type`, `upload_file_name`, `upload_file_size`, `upload_updated_at`) VALUES ('2013-08-20 08:32:49', '2013-08-20 08:32:49', 'application/pdf', 'paper.PDF', 873868, '2013-08-20 08:32:49')

  def destroy
    @upload = Upload.find(params[:id])
    FNORD_METRIC.event(@upload.attributes.merge(_type: :delete_uploaded_file))
    @upload.destroy
---
SELECT `uploads`.* FROM `uploads` WHERE `uploads`.`id` = 1 LIMIT 1
DELETE FROM `uploads` WHERE `uploads`.`id` = 1